Repository: arielen/test_Hatiko_tech
Catalog: bot/locales/*/LC_MESSAGES/messages.po
Languages: ru

source: ❌ Invalid command usage. Usage: `{command} <id>`
ru: ❌ Неверное использование команды. Пример: `{command} <id>`.

source: ❌ You do not have permission to use this command.
ru: ❌ У вас нет прав для выполнения этой команды.

source: ❌ User with ID {tg_id} does not exist.
ru: ❌ Пользователь с идентификатором {tg_id} не найден.

source: ❌ Invalid Telegram ID. Please provide a valid number.
ru: ❌ Неверный Telegram ID. Пожалуйста, укажите корректный номер.

source: ❌ You cannot remove the main admin.
ru: ❌ Вы не можете удалить главного администратора.

source: ⛔️ You do not have access to the bot functionality. Please contact the administrator to be added to the whitelist. 📩 Contact admin: @{adminUsername}
ru: ⛔️ У вас нет доступа к функционалу бота. Обратитесь к администратору, чтобы вас добавили в белый список. 📩 Связаться с администратором: @{adminUsername}

source: 🔢 Please enter the IMEI number (15 digits):
ru: 🔢 Пожалуйста, введите номер IMEI (15 цифр):

source: ❗ Please enter the IMEI number after the command, like this: `/check 123456789012345`
ru: ❗ Пожалуйста, введите номер IMEI после команды, например: `/check 123456789012345`

source: ✅ The IMEI number {imei} is valid. Fetching information about the device...
ru: ✅ Номер IMEI {imei} действителен. Получаем информацию об устройстве...

source: 📱 <b>✅ Verification complete! Here is the information for your device:</b> 🔹 <b>Name:</b> <b>{deviceName}</b> 🔹 <b>Serial Number:</b> <code>{serial}</code> 🔹 <b>Estimated Purchase Date:</b> {estPurchaseDate} 🖼 <b>Image:</b> <a href="{image}">Image Link</a> 📂 <b>Additional Data:</b> <pre>{additional_data}</pre>
ru: 📱 <b>✅ Проверка завершена! Информация об устройстве:</b> 🔹 <b>Название:</b> <b>{deviceName}</b> 🔹 <b>Серийный номер:</b> <code>{serial}</code> 🔹 <b>Предполагаемая дата покупки:</b> {estPurchaseDate} 🖼 <b>Изображение:</b> <a href="{image}">Ссылка</a> 📂 <b>Дополнительные данные:</b> <pre>{additional_data}</pre>

source: ❌ The IMEI number <code>{imei}</code> is invalid. Please enter a valid IMEI number. To find the IMEI on your device: 🔹 <b>For Android:</b> Dial <code>*#06#</code> or go to <b>Settings</b> → <b>About Phone</b> → <b>Status</b> → <b>IMEI Information</b>. 🔹 <b>For Apple (iPhone):</b> Dial <code>*#06#</code> or go to <b>Settings</b> → <b>General</b> → <b>About</b>, and scroll down to find the IMEI.
ru: ❌ Номер IMEI <code>{imei}</code> недействителен. Пожалуйста, введите корректный номер IMEI. Чтобы найти IMEI на вашем устройстве: 🔹 <b>Для Android:</b> наберите <code>*#06#</code> или перейдите в <b>Настройки</b> → <b>О телефоне</b> → <b>Статус</b> → <b>Информация об IMEI</b>. 🔹 <b>Для Apple (iPhone):</b> наберите <code>*#06#</code> или перейдите в <b>Настройки</b> → <b>Основные</b> → <b>Об этом устройстве</b>.

source: ❌ Device information could not be fetched. Reason: {reason}
ru: ❌ Не удалось получить информацию об устройстве. Причина: {reason}

source: ❌ An unexpected error occurred. Please try again later.
ru: ❌ Произошла непредвиденная ошибка. Пожалуйста, повторите попытку позже.

source: 📩 Need help? Contact the administrator: 🔹 [@{adminUsername}](https://t.me/{adminUsername})
ru: 📩 Нужна помощь? Свяжитесь с администратором: 🔹 [@{adminUsername}](https://t.me/{adminUsername})

source: 🔑 Your API token: `{token}`
ru: 🔑 Ваш токен API: `{token}`

source: 🤖 <b>Bot Command Guide:</b> 📌 <b>General Commands:</b> /start - Start interacting with the bot /help - Show this help message /language - Change the bot's language /myid - Get your Telegram ID
ru: 🤖 <b>Справка по командам бота:</b> 📌 <b>Общие команды:</b> /start - Начать работу с ботом /help - Показать справку /language - Сменить язык бота /myid - Получить свой Telegram ID

source: 📌 <b>IMEI Checking:</b> /check &lt;IMEI&gt; - Check device information using an IMEI number
ru: 📌 <b>Проверка IMEI:</b> /check &lt;IMEI&gt; - Проверка информации об устройстве по номеру IMEI

source: 📌 <b>IMEI Checking:</b> ⛔️ You do not have access to check IMEI. Ask an administrator to add you to the whitelist.
ru: 📌 <b>Проверка IMEI:</b> ⛔️ У вас нет доступа к проверке IMEI. Попросите администратора добавить вас в белый список.

source: 📌 <b>Admin Commands:</b> /add_admin &lt;id&gt; - Grant admin rights to a user /remove_admin &lt;id&gt; - Revoke admin rights from a user /add_whitelist &lt;id&gt; - Add a user to the whitelist /remove_whitelist &lt;id&gt; - Remove a user from the whitelist /get_token - Get your API token
ru: 📌 <b>Команды администратора:</b> /add_admin &lt;id&gt; - Назначить пользователя администратором /remove_admin &lt;id&gt; - Удалить пользователя из администраторов /add_whitelist &lt;id&gt; - Добавить пользователя в белый список /remove_whitelist &lt;id&gt; - Удалить пользователя из белого списка /get_token - Получить API токен

source: 📌 <b>Navigation:</b> Use inline buttons for language selection and other interactions. 🔹 If you experience any issues, use the /contact command to reach support.
ru: 📌 <b>Навигация:</b> Используйте встроенные кнопки для выбора языка и других взаимодействий. 🔹 Если у вас возникнут какие-либо проблемы, используйте команду /contact для связи со службой поддержки.

source: 🆔 Your Telegram ID: <code>{user_id}</code> This unique ID is used to identify you in the bot system.
ru: 🆔 Ваш Telegram ID: <code>{user_id}</code> Этот уникальный идентификатор используется для вашей идентификации в системе ботов.

source: 📖 Here's how to use the bot: 1️⃣ Send me your IMEI (15 digits) and I will check it for validity. 2️⃣ If IMEI is valid, I will provide information about your device. 3️⃣ If something goes wrong, you can contact support via the /contact command. You can also use the direct command. Example command: `/check 123456789012345`
ru: 📖 Как использовать бота: 1️⃣ Отправьте мне ваш IMEI (15 цифр), и я проверю его на валидность. 2️⃣ Если IMEI действителен, я предоставлю информацию об устройстве. 3️⃣ Если что-то пойдет не так, вы можете обратиться в поддержку с помощью команды /contact. Вы также можете использовать прямую команду. Пример команды: `/check 123456789012345`

source: 👋 Hi {userName}, I am a {namePlatform} for checking IMEI of devices. I can help you verify information about your device using its IMEI number. Please select a language:
ru: 👋 Привет, {userName}! Я {namePlatform} для проверки IMEI устройств. Я помогу вам проверить информацию об устройстве по его IMEI номеру. Пожалуйста, выберите язык:

source: Please select a language:
ru: Пожалуйста, выберите язык:

source: Language changed to {lang}
ru: Язык изменен на {lang}

source: No previous message to return to.
ru: Нет предыдущего сообщения для возврата.

source: 🔍 Check IMEI
ru: 🔍 Проверить IMEI

source: 📖 Help
ru: 📖 Помощь

source: 🌍 Change Language
ru: 🌍 Изменить язык

source: ➕ Add Admin (/add_admin)
ru: ➕ Добавить администратора (/add_admin)

source: ➖ Remove Admin (/remove_admin)
ru: ➖ Удалить администратора (/remove_admin)

source: ✅ Add to Whitelist (/add_whitelist)
ru: ✅ Добавить в белый список (/add_whitelist)

source: ❌ Remove from Whitelist (/remove_whitelist)
ru: ❌ Удалить из белого списка (/remove_whitelist)

source: 🔑 Get API Token (/get_token)
ru: 🔑 Получить API токен (/get_token)

source: 📖 Help (/help)
ru: 📖 Помощь (/help)

source: Admin options
ru: Опции администратора

source: 🔙 Back
ru: 🔙 Назад
